In [10]:
import numpy as np 
import pandas as pd

In [44]:
# Use the following dataframes:
products_df = pd.DataFrame({
'Product_ID': [1, 2, 3],
'Product_Name': ['iPhone 12', 'Samsung S21', 'Pixel 5'],
'Product_Price': [999, 899, 699],
})
sales_df = pd.DataFrame({
'Sale_ID': [1, 2, 3, 4, 5, 6, 7],
'Sale_Date': pd.to_datetime(['2021-01-01', '2021-02-01', '2021-02-15','2020-03-01', '2020-04-01','2020-02-15', '2020-01-01']),
'Customer_ID': [1, 2, 3, 2, 3, 4, 4],
'Product_ID': [1, 1, 2, 2, 3, 3, 1],
})
customers_df = pd.DataFrame({
'Customer_ID': [1, 2, 3, 4],
'Customer_Name': ['John Doe', 'Jane Doe', 'Jim Brown', 'Jake Smith'],
'Customer_Age': [25, 30, 35, 20],
'Customer_Email': ['john@doe.com', 'jane@doe.com', 'jim@brown.com','jake@smith.com'],
})

In [46]:
products_df

   Product_ID Product_Name  Product_Price
0           1    iPhone 12            999
1           2  Samsung S21            899
2           3      Pixel 5            699

In [48]:
sales_df

   Sale_ID  Sale_Date  Customer_ID  Product_ID
0        1 2021-01-01            1           1
1        2 2021-02-01            2           1
2        3 2021-02-15            3           2
3        4 2020-03-01            2           2
4        5 2020-04-01            3           3
5        6 2020-02-15            4           3
6        7 2020-01-01            4           1

In [50]:
customers_df

   Customer_ID Customer_Name  Customer_Age  Customer_Email
0            1      John Doe            25    john@doe.com
1            2      Jane Doe            30    jane@doe.com
2            3     Jim Brown            35   jim@brown.com
3            4    Jake Smith            20  jake@smith.com

- Having the products_df and sales_df, merge both dataframes using
'Product_ID' as the key. Once you have it, display only the Sale_ID,
Product_Name and Product_Price columns.

In [53]:
merge_df = pd.merge(products_df,sales_df, on= "Product_ID" , how= "inner")
merge_df[["Sale_ID","Product_Name","Product_Price"]]

   Sale_ID Product_Name  Product_Price
0        1    iPhone 12            999
1        2    iPhone 12            999
2        7    iPhone 12            999
3        3  Samsung S21            899
4        4  Samsung S21            899
5        5      Pixel 5            699
6        6      Pixel 5            699

3) Add the following additional dataframes:
"""

apple_products_df = pd.DataFrame({
    'Product_ID': [4, 5],
    'Product_Name': ['iPhone 13', 'Apple Watch Series 6'],
    'Product_Price': [999, 399],
})

samsung_products_df = pd.DataFrame({
    'Product_ID': [6, 7],
    'Product_Name': ['Samsung S22', 'Galaxy Watch 4'],
    'Product_Price': [999, 250],
})

- Concatenate these dataframes with the original products_df and show the
final dataframe. Use a copy() and donâ€™t change the original products_df.

In [56]:
apple_products_df = pd.DataFrame({
    'Product_ID': [4, 5],
    'Product_Name': ['iPhone 13', 'Apple Watch Series 6'],
    'Product_Price': [999, 399],
})

samsung_products_df = pd.DataFrame({
    'Product_ID': [6, 7],
    'Product_Name': ['Samsung S22', 'Galaxy Watch 4'],
    'Product_Price': [999, 250],
})

In [58]:
concat_df =  pd.concat([products_df,apple_products_df,samsung_products_df],axis=0).copy()
concat_df

   Product_ID          Product_Name  Product_Price
0           1             iPhone 12            999
1           2           Samsung S21            899
2           3               Pixel 5            699
0           4             iPhone 13            999
1           5  Apple Watch Series 6            399
0           6           Samsung S22            999
1           7        Galaxy Watch 4            250

4) With the resulting df from Exercise 1, group it by Product_Name and calculate
the total Product_Price.

In [34]:
all_products_df = pd.concat([products_df.copy(), apple_products_df, samsung_products_df], ignore_index=True)
grouped_products = all_products_df.groupby('Product_Name')['Product_Price'].sum()
grouped_products

Product_Name
Apple Watch Series 6    399
Galaxy Watch 4          250
Pixel 5                 699
Samsung S21             899
Samsung S22             999
iPhone 12               999
iPhone 13               999
Name: Product_Price, dtype: int64

5) In the customers_df dataframe, set 'Customer_ID' and 'Customer_Email' as
indexes (multi indexing).
After that, display all the customers whose ID is less than 3.

In [62]:
customers_df = customers_df.set_index(['Customer_ID', 'Customer_Email'])
print(customers_df)

customers_less_than_3 = customers_df.loc[customers_df.index.get_level_values('Customer_ID') < 3]
print(customers_less_than_3)

                           Customer_Name  Customer_Age
Customer_ID Customer_Email
1           john@doe.com        John Doe            25
2           jane@doe.com        Jane Doe            30
3           jim@brown.com      Jim Brown            35
4           jake@smith.com    Jake Smith            20
                           Customer_Name  Customer_Age
Customer_ID Customer_Email
1           john@doe.com        John Doe            25
2           jane@doe.com        Jane Doe            30

6) Use merge, groupby, and other necessary functions to answer these
questions:
-    a. Which customer(s) bought the most expensive product?
-    b. On which date did we get the highest number of sales?
-    c. What is the average price of the products purchased by each customer?
Remember to use multi-indexing, groupby, and date-time concepts wherever
necessary.

In [66]:
# A
most_expensive_product_price = products_df['Product_Price'].max()
most_expensive_product_name = products_df.loc[products_df['Product_Price'] == most_expensive_product_price, 'Product_Name'].iloc[0]

customers_most_expensive = pd.merge(merge_df, customers_df.reset_index(), on='Customer_ID')
customers_most_expensive = customers_most_expensive[customers_most_expensive['Product_Name'] == most_expensive_product_name]
print(f"Customer(s) who bought the most expensive product ({most_expensive_product_name}):")
print(customers_most_expensive['Customer_Name'].unique())

Customer(s) who bought the most expensive product (iPhone 12):
['John Doe' 'Jane Doe' 'Jake Smith']

In [68]:
# B
sales_count_by_date = sales_df.groupby('Sale_Date')['Sale_ID'].count()
highest_sales_date = sales_count_by_date.idxmax()
print(f"Date with the highest number of sales: {highest_sales_date}")

Date with the highest number of sales: 2020-01-01 00:00:00

In [72]:
# C 
average_price_by_customer = merge_df.groupby('Customer_ID')['Product_Price'].mean()
print(f"Average price of products purchased by each customer:\n{average_price_by_customer}")

Average price of products purchased by each customer:
Customer_ID
1    999.0
2    949.0
3    799.0
4    849.0
Name: Product_Price, dtype: float64